# ----MAIN MENU----

ABOUT_SANTA_GAME = 'Это адаптированная игра "Тайный Санта"'

REMINDER_FOR_USER = ('❗ <b>Не забудь обновить свои конт актные данные '
                     'в настройках профиля</b>.\n\n'
                     '❗ <b>Иначе Санта не сможет отправить тебе подарок.</b>\n\n')

MENU_TEXT_NAME = '<b>Меню</b>'

START_GAME_MENU = ("Хо-хо-хо! 🎅\n\n"
                   "Вот и настало поиграть в Тайного Санту!\n\n"
                   "Создай свою комнату для друзей, или подключись к существующей.")

# ---ROOM_MENU----
# change owner
USER_NOT_FOUND = 'Такой участник не найден.'
CHANGE_MAIN_QUESTION = ('Хочешь поменять владельца комнаты?\n'
                        'Новый владелец комнаты должен являться ее участником. '
                        '<b>Учти, что ты потеряешь контроль за комнатой.</b>\n\n'
                        '<b>Для смены владельца, напиши его ник.</b>\n')

CHANGE_COMPLETE_ANSWER = ('"Хо-хо-хо! 🎅\n\n'
                          'Я сменил владельца, теперь это <b>{0}</b>')

GENERAL_COMPLETED_GAME = ("<b>Игра завершена!</b>\n\n"
                          "Вы стали Тайным Сантой для:\n"
                          "{0}\n"
                          "Ты можешь написать сообщение своему Тайному Санте,"
                          "или отправить сообщение своему получателю.\n\n"
                          "<b>Учти, что в сутки можно отправлять не более 3х сообщений.</b>")

CONTROL_ROOM = "<b>Управление комнатой {0} ({1})</b>"
CONTROL_ROOM_SCHEDULER = ("<b>🕓 Игра в текущей комнате запущена на "
                          "{0}</b>\n\n")
LIST_MEMBERS = 'Список участников комнаты: {0} ({1}):\n\n{2}'

# Config room
CONFIG_ROOM_MENU = "Настройки комнаты: <b>{0}</b> (<b>{1}</b>)"

# Delete room
DELETE_ROOM_MAIN_QUESTION = ('❌<b>Комната будет удалена без'
                             ' возможности восстановления</b>.\n\n'
                             'Для подтверждения удаления комнаты <b>{0}</b>, '
                             'введите в чат <b>подтверждаю</b>.\n\n ')

DELETE_CONFIRMATION_COMMAND = 'подтверждаю'
DELETE_ROOM_INCORRECT_CONF_COMMAND = 'Вы ввели неверную команду для подтверждения, попробуйте снова.\n'
DELETE_ROOM_SUCCEFUL = ('Комната успешно удалена\n\n '
                        'Вы можете создать новую комнату в основном меню.')
DELETE_ROOM_SOMETHING_WRONG = 'Что-то пошло не так, комната не была удалена'

# Subscribe room
SUBSCRIBE_MAIN_QUESTION = ('"Хо-хо-хо! 🎅\n\n'
                           'Введи номер комнаты в которую ты хочешь зайти.\n')

SUBSCRIBE_IS_NOT_DIGIT = 'Номер комнаты может содержать только цифры, попробуйте снова.'
SUBSCRIBE_INCORRECT_ROOM_NUMBER = 'Введенной комнаты не существует, введите корректный номер.'
SUBSCRIBE_ALREADY_MEMBER = 'Вы уже состоите в этой комнате.'
SUBSCRIBE_WISHES = ('А теперь напишите свои пожелания к подарку. '
                    'Возможно у тебя есть хобби и '
                    'ты хочешь получить что-то особое?\n'
                    'Ваши комментарии помогут Тайному Санте '
                    'выбрать для вас подарок.\n')

SUBSCRIBE_FINAL_ANSWER = ('"Хо-хо-хо! 🎅\n\n'
                          'Теперь ты можешь играть с своими друзьями.\n'
                          'Следи за анонсами владельца комнаты.\n\n'
                          'Желаю хорошей игры! 😋')

# ----PROFILE_MENU----
